j1939plugin.org
#+title: Project Journal: OpenSyde Plugins (J1939)
#+setupfile: /home/scurfman/org/gtd/theme-readtheorg.setup
#+options: ^:nil

* 2024
** 2024-01 January
*** 2024-01-17 Wednesday
**** J1939 Roadmap Review 2 [2024-01-18 Thu 10:00] Teams Meeting
***** DONE Introductory Tasks [3/4]
CLOSED: [2024-01-22 Mon 10:14]
- [X] Teams meeting
- [X] Download resources
- [X] Install toolchain(s)
- [ ] Open and test compile current project state
*** 2024-01-18 Thursday
**** J1939 Onboarding continued
***** DONE Continued setup tasks [3/3]
CLOSED: [2024-01-22 Mon 10:15]
- [X] Open and test compile current project state
- [X] Explore structure of openSYDE master project via Qt
- [X] Explore structure of J1939 plugin project via Qt
*** 2024-01-22 Monday
#+BEGIN: clocktable :scope subtree :maxlevel 5
#+CAPTION: Clock summary at [2024-01-22 Mon 13:14]
| Headline                                 | Time   |   |      |      |      |
|------------------------------------------+--------+---+------+------+------|
| *Total time*                             | *7:01* |   |      |      |      |
|------------------------------------------+--------+---+------+------+------|
| \_    2024-01-22 Monday                  |        |   | 7:01 |      |      |
| \_      Qt Creator Onboarding continued  |        |   |      | 7:01 |      |
| \_        30,000ft Flyby                 |        |   |      |      | 2:00 |
| \_        NOTES: Existing Code Review... |        |   |      |      | 5:01 |
#+END:

**** Qt Creator Onboarding continued
***** 30,000ft Flyby
:LOGBOOK:
CLOCK: [2024-01-22 Mon 06:00]--[2024-01-22 Mon 08:00] =>  2:00
:END:
1. Problem to solve?
   1. Stock gmbh openSYDE J1939 functionality does not include things we need for our customers
2. Solution?
   1. The software is open source, we have the resources, we will make a plugin to openSYDE with the features our customers need.
***** NOTE: BE SURE TO REVIEW CONTENTS OF ALL KNOWN PROJECT RESOURCES
+ STW Jira Tracker: [[https://stwtechnic.atlassian.net/jira/software/projects/OPSYD/boards/27/timeline][Project Link]]
+ STW Google Drive: [[https://drive.google.com/drive/folders/1LQMNFF7mvlYptHVTjCt1jj7cozGVKKne?usp=drive_link][G Drive link]]
+ STW Teams Chat Log: see Teams
+ Github J1939 project: [[https://github.com/STW-Technic-LP/J1939Plugin][Github link]]
***** Current Project State [2024-01-22 Mon 08:25]
+ Epic OPSYD-16 MVP CLOSED
+ Epic OPSYD-17 2.0 OPEN
+ Primary is TG.  SC has been added to project and onboarding.
  + Currently TG is on PTO until [2024-01-24 Wed] .  SC will review Qt project, J1939 code so far, and J1939 standards while TG is out.
***** TODO Qt Creator 12 STW [4/5] [2024-01-22 Mon 07:53]
- [X] Review Jira status (Backlog tab) for OpenSyde Plugins (J1939) [[https://stwtechnic.atlassian.net/jira/software/projects/OPSYD/boards/27/backlog][jira task]]
- [X] 30,000 ft code review of J1939 plugin code
- [X] Create running Question & Answer list (QnA)
- [X] Do a light review of built-in openCAN message handling using Qt Creator IDE.
- [ ] Select and begin viewing a Qt Creator tutorial playlist to familiarize with the IDE
  - special attention to SLOTS, SIGNALS, [[https://www.youtube.com/watch?v=xHd5Ga8uihE][signals and slots]] example.
    - will look something like:
     #+begin_src C++
       QObject::connect (slider, &QSlider::valueChanged, spinBox, &QSpinBox::setValue);
     #+end_src
    - 'connect' = method,
    - 'slider' = sender of the message
    - '&QSlider::valueChanged' = the specific signal the sender will transmit 
    - 'spinBox' = reciever of the message
    - '&QSpinBox::setValue' = the specific slot opened up by the reciever to store the signal
    - you can connect multiple signals to one slot, you can also connect one signal to multiple slots.  Neither object needs to know anything about the other object to work this way.
  - take close look at j1939dbc.cpp, parsing J1939 DBC text from xml?
***** TODO QnA List [1/2]
- [ ] QSTRING, going to be a major function used here?
- [X] Jira, what is the current sprint for this project right now?
  - tasks = small portions completable by one person, in a day?
  - stories = larger scope, can be multiple team, multiple people,
  - hierarchy = Initiative or Project -> Epic(s) -> Stories -> Tasks -> Subtasks -> *Bugs
  - Jira Docs [[https://confluence.atlassian.com/advancedroadmapsserver0329/configuring-initiatives-and-other-hierarchy-levels-1021218664.html][hierarchy]]
  - Currently on Epic OPSYD-17 2.0
