j1939plugin.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-31 Wed 07:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Project Journal: OpenSyde Plugins (J1939)</title>
<meta name="author" content="scurfman" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">Project Journal: OpenSyde Plugins (J1939)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb7b49d7">1. 2024</a>
<ul>
<li><a href="#org8c03eed">1.1. 2024-01 January</a>
<ul>
<li><a href="#org6c44312">1.1.1. 2024-01-17 Wednesday</a></li>
<li><a href="#orgd987a2c">1.1.2. 2024-01-18 Thursday</a></li>
<li><a href="#orgffa8329">1.1.3. 2024-01-22 Monday</a></li>
<li><a href="#org326f5eb">1.1.4. 2024-01-23 Tuesday</a></li>
<li><a href="#orgd40e229">1.1.5. 2024-01-24 Wednesday</a></li>
<li><a href="#orgb45eb28">1.1.6. 2024-01-25 Thursday</a></li>
<li><a href="#org0a52f1a">1.1.7. 2024-01-26 Friday</a></li>
<li><a href="#org7b61e5c">1.1.8. 2024-01-29 Monday</a></li>
<li><a href="#orgbc8717c">1.1.9. 2024-01-30 Tuesday</a></li>
<li><a href="#org235cb10">1.1.10. 2024-01-31 Wednesday</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb7b49d7" class="outline-2">
<h2 id="orgb7b49d7"><span class="section-number-2">1.</span> 2024</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8c03eed" class="outline-3">
<h3 id="org8c03eed"><span class="section-number-3">1.1.</span> 2024-01 January</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org6c44312" class="outline-4">
<h4 id="org6c44312"><span class="section-number-4">1.1.1.</span> 2024-01-17 Wednesday</h4>
<div class="outline-text-4" id="text-1-1-1">
</div>
<ol class="org-ol">
<li><a id="orged7cf00"></a>J1939 Roadmap Review 2 <span class="timestamp-wrapper"><span class="timestamp">[2024-01-18 Thu 10:00] </span></span> Teams Meeting<br />
<ol class="org-ol">
<li><a id="orgf4d1244"></a><span class="done DONE">DONE</span> Introductory Tasks <code>[3/4]</code><br />
<div class="outline-text-6" id="text-1-1-1-1-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> Teams meeting</li>
<li class="on"><code>[X]</code> Download resources</li>
<li class="on"><code>[X]</code> Install toolchain(s)</li>
<li class="off"><code>[&#xa0;]</code> Open and test compile current project state</li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgd987a2c" class="outline-4">
<h4 id="orgd987a2c"><span class="section-number-4">1.1.2.</span> 2024-01-18 Thursday</h4>
<div class="outline-text-4" id="text-1-1-2">
</div>
<ol class="org-ol">
<li><a id="org2290f5a"></a>J1939 Onboarding continued<br />
<ol class="org-ol">
<li><a id="org774ae56"></a><span class="done DONE">DONE</span> Continued setup tasks <code>[3/3]</code><br />
<div class="outline-text-6" id="text-1-1-2-1-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> Open and test compile current project state</li>
<li class="on"><code>[X]</code> Explore structure of openSYDE master project via Qt</li>
<li class="on"><code>[X]</code> Explore structure of J1939 plugin project via Qt</li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgffa8329" class="outline-4">
<h4 id="orgffa8329"><span class="section-number-4">1.1.3.</span> 2024-01-22 Monday</h4>
<div class="outline-text-4" id="text-1-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> Clock summary at <span class="timestamp-wrapper"><span class="timestamp">[2024-01-22 Mon 13:14]</span></span></caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Headline</th>
<th scope="col" class="org-left">Time</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Total time</b></td>
<td class="org-left"><b>7:01</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;2024-01-22 Monday</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">7:01</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;Qt Creator Onboarding continued</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">7:01</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;30,000ft Flyby</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">2:00</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;NOTES: Existing Code Review&#x2026;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">5:01</td>
</tr>
</tbody>
</table>
</div>

<ol class="org-ol">
<li><a id="orgeed37d6"></a>Qt Creator Onboarding continued<br />
<ol class="org-ol">
<li><a id="orga4e1ad8"></a>30,000ft Flyby<br />
<div class="outline-text-6" id="text-1-1-3-1-1">
<ol class="org-ol">
<li>Problem to solve?
<ol class="org-ol">
<li>Stock gmbh openSYDE J1939 functionality does not include things we need for our customers</li>
</ol></li>
<li>Solution?
<ol class="org-ol">
<li>The software is open source, we have the resources, we will make a plugin to openSYDE with the features our customers need.</li>
</ol></li>
</ol>
</div>
</li>
<li><a id="org5c0a110"></a>NOTE: BE SURE TO REVIEW CONTENTS OF ALL KNOWN PROJECT RESOURCES<br />
<div class="outline-text-6" id="text-1-1-3-1-2">
<ul class="org-ul">
<li>STW Jira Tracker: <a href="https://stwtechnic.atlassian.net/jira/software/projects/OPSYD/boards/27/timeline">Project Link</a></li>
<li>STW Google Drive: <a href="https://drive.google.com/drive/folders/1LQMNFF7mvlYptHVTjCt1jj7cozGVKKne?usp=drive_link">G Drive link</a></li>
<li>STW Teams Chat Log: see Teams</li>
<li>Github J1939 project: <a href="https://github.com/STW-Technic-LP/J1939Plugin">Github link</a></li>
</ul>
</div>
</li>
<li><a id="org976627d"></a>Current Project State <span class="timestamp-wrapper"><span class="timestamp">[2024-01-22 Mon 08:25]</span></span><br />
<div class="outline-text-6" id="text-1-1-3-1-3">
<ul class="org-ul">
<li>Epic OPSYD-16 MVP CLOSED</li>
<li>Epic OPSYD-17 2.0 OPEN</li>
<li>Primary is TG.  SC has been added to project and onboarding.
<ul class="org-ul">
<li>Currently TG is on PTO until <span class="timestamp-wrapper"><span class="timestamp">[2024-01-24 Wed] </span></span> .  SC will review Qt project, J1939 code so far, and J1939 standards while TG is out.</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="org51ab28b"></a><span class="todo TODO">TODO</span> Qt Creator 12 STW <code>[4/5]</code> <span class="timestamp-wrapper"><span class="timestamp">[2024-01-22 Mon 07:53]</span></span><br />
<div class="outline-text-6" id="text-1-1-3-1-4">
<ul class="org-ul">
<li class="on"><code>[X]</code> Review Jira status (Backlog tab) for OpenSyde Plugins (J1939) <a href="https://stwtechnic.atlassian.net/jira/software/projects/OPSYD/boards/27/backlog">jira task</a></li>
<li class="on"><code>[X]</code> 30,000 ft code review of J1939 plugin code</li>
<li class="on"><code>[X]</code> Create running Question &amp; Answer list (QnA)</li>
<li class="on"><code>[X]</code> Do a light review of built-in openCAN message handling using Qt Creator IDE.</li>
<li class="off"><code>[&#xa0;]</code> Select and begin viewing a Qt Creator tutorial playlist to familiarize with the IDE
<ul class="org-ul">
<li>special attention to SLOTS, SIGNALS, <a href="https://www.youtube.com/watch?v=xHd5Ga8uihE">signals and slots</a> example.
<ul class="org-ul">
<li><p>
will look something like:
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #a45bad;">QObject</span>::connect <span style="color: #4f97d7;">(</span>slider, &amp;<span style="color: #a45bad;">QSlider</span>::valueChanged, spinBox, &amp;<span style="color: #a45bad;">QSpinBox</span>::setValue<span style="color: #4f97d7;">)</span>;
</pre>
</div></li>
<li>'connect' = method,</li>
<li>'slider' = sender of the message</li>
<li>'&amp;QSlider::valueChanged' = the specific signal the sender will transmit</li>
<li>'spinBox' = reciever of the message</li>
<li>'&amp;QSpinBox::setValue' = the specific slot opened up by the reciever to store the signal</li>
<li>you can connect multiple signals to one slot, you can also connect one signal to multiple slots.  Neither object needs to know anything about the other object to work this way.</li>
</ul></li>
<li>take close look at j1939dbc.cpp, parsing J1939 DBC text from xml?</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="org24d8fa9"></a><span class="todo TODO">TODO</span> QnA List <code>[1/2]</code><br />
<div class="outline-text-6" id="text-1-1-3-1-5">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QSTRING, going to be a major function used here?</li>
<li class="on"><code>[X]</code> Jira, what is the current sprint for this project right now?
<ul class="org-ul">
<li>tasks = small portions completable by one person, in a day?</li>
<li>stories = larger scope, can be multiple team, multiple people,</li>
<li>hierarchy = Initiative or Project -&gt; Epic(s) -&gt; Stories -&gt; Tasks -&gt; Subtasks -&gt; *Bugs</li>
<li>Jira Docs <a href="https://confluence.atlassian.com/advancedroadmapsserver0329/configuring-initiatives-and-other-hierarchy-levels-1021218664.html">hierarchy</a></li>
<li>Currently on Epic OPSYD-17 2.0</li>
</ul></li>
</ul>
</div>
</li>
