j1939plugin.org
***** NOTES: Existing Code Review (fleeting, unsorted):  
:LOGBOOK:
CLOCK: [2024-01-22 Mon 08:09]--[2024-01-22 Mon 13:10] =>  5:01
:END:
+ Current Epic has 9/17 issues in Backlog.
  + most issues fall under either UI or features to finish in the plugin code
  + otherwise tasks fall under J1939 hierarchy of DBC, PGN, or SPN related tasks.
  + Q?: While TG is out, review stock openCAN message handling inside Qt Creator as reference for J1939?
  + Qt docs are good, but also some 3rd party tutorials available, see [[https://www.cleanqt.io/blog/crash-course-in-qt-for-c%2B%2B-developers,-part-1][cleanqt.io]]
  + other frequently used Qt methods in the J1939 plug-in:
    + QFile, QIODevice, QDomNodeList, QDomElement, QDomDocument, QObject, QDir, QFileDialog
  + OpenSYDE canOpen tools in 'bus_edit' section.  Reviews Signals methods in bus_edit.
***** NOTES: Qt Creator onboarding, walk-thru(s)  
:LOGBOOK:
CLOCK: [2024-01-22 Mon 14:40]--[2024-01-22 Mon 15:20] =>  0:40
:END:
+ Refer to built in example files in Qt Creator, select a widget based application example
  + Example 1: Building and Running an Example
    - [X] Test install by opening an example
  + Example 2: Build a widget based project
    - [ ] to follow along exactly, had to briefly install msvc compiler (not going to use for STW projects though)
*** 2024-01-23 Tuesday
#+BEGIN: clocktable :scope subtree :maxlevel 5
#+CAPTION: Clock summary at [2024-01-23 Tue 15:32]
| Headline                                    | Time   |   |      |      |      |
|---------------------------------------------+--------+---+------+------+------|
| *Total time*                                | *7:11* |   |      |      |      |
|---------------------------------------------+--------+---+------+------+------|
| \_    2024-01-23 Tuesday                    |        |   | 7:11 |      |      |
| \_      Qt Creator review continued.        |        |   |      | 5:49 |      |
| \_        Qt Creator Examples: continued    |        |   |      |      | 0:30 |
| \_      J1939 Plugin Code Review continued: |        |   |      | 1:22 |      |
#+END:

**** Qt Creator review continued.  
:LOGBOOK:
CLOCK: [2024-01-23 Tue 12:10]--[2024-01-23 Tue 12:32] =>  0:22
CLOCK: [2024-01-23 Tue 08:37]--[2024-01-23 Tue 11:26] =>  2:49
CLOCK: [2024-01-23 Tue 06:15]--[2024-01-23 Tue 08:23] =>  2:08
:END:
***** Focus on Qt Creator 12 today
+ Very robust documentation.  Lots of tutorials, examples, help files, etc.  Also many third party learning resources.
+ Primary: start with Qt internal documentation.
  + Find 3-4 tutorial or example projects suitable for STW (desktop application, xml / csv parsing, file handling, etc)
  + Track notes on Qt examples here in .org file.
  + Create a running list of QnA for TG / JG / AR as progress through the documentation
  + MAYBE? Try to identify Qt elements used by stock openSYDE canOPEN signals UI.
+ Secondary resource, pay special attention to YT channel @KDABtv and @VoidRealms.
+ NOTE: Qt Creator installation necessary for J1939 plugin does not include resources used in the built in examples.  To follow examples, may need to install more components.
+ NOTE: So many learning tools require latest Qt.  Leaving 5.15.2 installed on STW laptop for production, co-installing 6.6 on personal laptop, + all tools for training.
***** Qt Creator Example 1: (on hold while setting up training laptop)
****** INTERMEDIATE PROJECT: Find info on string parsing DBC if possible.
+ Web based DBC editing tool by CSS [[https://www.csselectronics.com/pages/dbc-editor-can-bus-database][link]]
+ Find a source of sample DBC files to test with off line, off IDE, just use regex to experiment.
+ Good info from copperhill media as well
***** Qt Creator Examples: continued
:LOGBOOK:
CLOCK: [2024-01-23 Tue 13:40]--[2024-01-23 Tue 14:10] =>  0:30
:END:
+ Qt built in tutorials and examples now running on training laptop (Qt v. 6.6)
+ Selected some built in examples that relate in some way to the J1939 plugin project.
****** CONTAINER EXTENSION EXAMPLE [[https://doc.qt.io/qt-6/qtdesigner-containerextension-example.html#:~:text=The%20Container%20Extension%20example%20consists,MultiPageWidget%20class%20to%20Qt%20Designer.][link]]
****** TASK MENU EXTENSION EXAMPLE [[https://doc.qt.io/qt-6/qtdesigner-containerextension-example.html#:~:text=The%20Container%20Extension%20example%20consists,MultiPageWidget%20class%20to%20Qt%20Designer.][link]]
****** QREGULAR EXPRESSION EXAMPLE [[https://doc.qt.io/qt-6/qtwidgets-tools-regularexpression-example.html][link]]
****** ECHO PLUGIN EXAMPLE [[https://doc.qt.io/qt-6/qtwidgets-tools-echoplugin-example.html][link]]
****** NETWORK CHAT EXAMPLE [[https://doc.qt.io/qt-6/qtnetwork-network-chat-example.html][link]]
****** FFT SPECTRUM EXAMPLE [[https://doc.qt.io/qt-5/qtmultimedia-multimedia-spectrum-example.htmli][link]]
***** "Qt Group" Official Video Tutorials.  "Tutorials" Playlist (YT)
**** J1939 Plugin Code Review continued:
:LOGBOOK:
CLOCK: [2024-01-23 Tue 14:10]--[2024-01-23 Tue 15:32] =>  1:22
:END:
+ Went back to our code after getting more familiar with Qt.
+ Compiled and ran most recent J1939, this time kept console window open while navigating openSYDE.
+ Noticed Qt errors when in trying to define new system.  Half dozen missing .svg icon elements.  Didn't notice first time compiling.
+ Found matching name .svg's in a previous .zip project.  Copied them over the the folder structure in the Qt Warning / Errors.
+ Recompiled and ran.  No problems.  Continued to define a system, add node, add bus, enable J1939 datapool, and edit J1939 message from Bus interface.
+ stopped here.
