j1939plugin.html
<li><a id="orga2fa6d3"></a>NOTES: Existing Code Review (fleeting, unsorted):<br />
<div class="outline-text-6" id="text-1-1-3-1-6">
<ul class="org-ul">
<li>Current Epic has 9/17 issues in Backlog.
<ul class="org-ul">
<li>most issues fall under either UI or features to finish in the plugin code</li>
<li>otherwise tasks fall under J1939 hierarchy of DBC, PGN, or SPN related tasks.</li>
<li>Q?: While TG is out, review stock openCAN message handling inside Qt Creator as reference for J1939?</li>
<li>Qt docs are good, but also some 3rd party tutorials available, see <a href="https://www.cleanqt.io/blog/crash-course-in-qt-for-c%2B%2B-developers,-part-1">cleanqt.io</a></li>
<li>other frequently used Qt methods in the J1939 plug-in:
<ul class="org-ul">
<li>QFile, QIODevice, QDomNodeList, QDomElement, QDomDocument, QObject, QDir, QFileDialog</li>
</ul></li>
<li>OpenSYDE canOpen tools in 'bus_edit' section.  Reviews Signals methods in bus_edit.</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="org0fa68b1"></a>NOTES: Qt Creator onboarding, walk-thru(s)<br />
<div class="outline-text-6" id="text-1-1-3-1-7">
<ul class="org-ul">
<li>Refer to built in example files in Qt Creator, select a widget based application example
<ul class="org-ul">
<li>Example 1: Building and Running an Example
<ul class="org-ul">
<li class="on"><code>[X]</code> Test install by opening an example</li>
</ul></li>
<li>Example 2: Build a widget based project
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> to follow along exactly, had to briefly install msvc compiler (not going to use for STW projects though)</li>
</ul></li>
</ul></li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org326f5eb" class="outline-4">
<h4 id="org326f5eb"><span class="section-number-4">1.1.4.</span> 2024-01-23 Tuesday</h4>
<div class="outline-text-4" id="text-1-1-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 2:</span> Clock summary at <span class="timestamp-wrapper"><span class="timestamp">[2024-01-23 Tue 15:32]</span></span></caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Headline</th>
<th scope="col" class="org-left">Time</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Total time</b></td>
<td class="org-left"><b>7:11</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;2024-01-23 Tuesday</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">7:11</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;Qt Creator review continued.</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">5:49</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;Qt Creator Examples: continued</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">0:30</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;J1939 Plugin Code Review continued:</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">1:22</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>

<ol class="org-ol">
<li><a id="orgcfa7a5f"></a>Qt Creator review continued.<br />
<div class="outline-text-5" id="text-1-1-4-1">
</div>
<ol class="org-ol">
<li><a id="org5d2f504"></a>Focus on Qt Creator 12 today<br />
<div class="outline-text-6" id="text-1-1-4-1-1">
<ul class="org-ul">
<li>Very robust documentation.  Lots of tutorials, examples, help files, etc.  Also many third party learning resources.</li>
<li>Primary: start with Qt internal documentation.
<ul class="org-ul">
<li>Find 3-4 tutorial or example projects suitable for STW (desktop application, xml / csv parsing, file handling, etc)</li>
<li>Track notes on Qt examples here in .org file.</li>
<li>Create a running list of QnA for TG / JG / AR as progress through the documentation</li>
<li>MAYBE? Try to identify Qt elements used by stock openSYDE canOPEN signals UI.</li>
</ul></li>
<li>Secondary resource, pay special attention to YT channel @KDABtv and @VoidRealms.</li>
<li>NOTE: Qt Creator installation necessary for J1939 plugin does not include resources used in the built in examples.  To follow examples, may need to install more components.</li>
<li>NOTE: So many learning tools require latest Qt.  Leaving 5.15.2 installed on STW laptop for production, co-installing 6.6 on personal laptop, + all tools for training.</li>
</ul>
</div>
</li>
<li><a id="org3f3a7c9"></a>Qt Creator Example 1: (on hold while setting up training laptop)<br />
<ol class="org-ol">
<li><a id="orgd6231f7"></a>INTERMEDIATE PROJECT: Find info on string parsing DBC if possible.<br />
<div class="outline-text-7" id="text-1-1-4-1-2-1">
<ul class="org-ul">
<li>Web based DBC editing tool by CSS <a href="https://www.csselectronics.com/pages/dbc-editor-can-bus-database">link</a></li>
<li>Find a source of sample DBC files to test with off line, off IDE, just use regex to experiment.</li>
<li>Good info from copperhill media as well</li>
</ul>
</div>
</li>
</ol>
</li>
<li><a id="org302e164"></a>Qt Creator Examples: continued<br />
<div class="outline-text-6" id="text-1-1-4-1-3">
<ul class="org-ul">
<li>Qt built in tutorials and examples now running on training laptop (Qt v. 6.6)</li>
<li>Selected some built in examples that relate in some way to the J1939 plugin project.</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org5a41a7a"></a>CONTAINER EXTENSION EXAMPLE <a href="https://doc.qt.io/qt-6/qtdesigner-containerextension-example.html#:~:text=The%20Container%20Extension%20example%20consists,MultiPageWidget%20class%20to%20Qt%20Designer.">link</a><br /></li>
<li><a id="orga989d74"></a>TASK MENU EXTENSION EXAMPLE <a href="https://doc.qt.io/qt-6/qtdesigner-containerextension-example.html#:~:text=The%20Container%20Extension%20example%20consists,MultiPageWidget%20class%20to%20Qt%20Designer.">link</a><br /></li>
<li><a id="orgaa03086"></a>QREGULAR EXPRESSION EXAMPLE <a href="https://doc.qt.io/qt-6/qtwidgets-tools-regularexpression-example.html">link</a><br /></li>
<li><a id="org7706d15"></a>ECHO PLUGIN EXAMPLE <a href="https://doc.qt.io/qt-6/qtwidgets-tools-echoplugin-example.html">link</a><br /></li>
<li><a id="org812d5ac"></a>NETWORK CHAT EXAMPLE <a href="https://doc.qt.io/qt-6/qtnetwork-network-chat-example.html">link</a><br /></li>
<li><a id="org685d60f"></a>FFT SPECTRUM EXAMPLE <a href="https://doc.qt.io/qt-5/qtmultimedia-multimedia-spectrum-example.htmli">link</a><br /></li>
</ol>
</li>
<li><a id="org6495296"></a>"Qt Group" Official Video Tutorials.  "Tutorials" Playlist (YT)<br /></li>
</ol>
</li>
<li><a id="org43ce7d6"></a>J1939 Plugin Code Review continued:<br />
<div class="outline-text-5" id="text-1-1-4-2">
<ul class="org-ul">
<li>Went back to our code after getting more familiar with Qt.</li>
<li>Compiled and ran most recent J1939, this time kept console window open while navigating openSYDE.</li>
<li>Noticed Qt errors when in trying to define new system.  Half dozen missing .svg icon elements.  Didn't notice first time compiling.</li>
<li>Found matching name .svg's in a previous .zip project.  Copied them over the the folder structure in the Qt Warning / Errors.</li>
<li>Recompiled and ran.  No problems.  Continued to define a system, add node, add bus, enable J1939 datapool, and edit J1939 message from Bus interface.</li>
<li>stopped here.</li>
</ul>
</div>
</li>
</ol>
</div>
