j1939plugin.html
<div id="outline-container-orgd40e229" class="outline-4">
<h4 id="orgd40e229"><span class="section-number-4">1.1.5.</span> 2024-01-24 Wednesday</h4>
<div class="outline-text-4" id="text-1-1-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 3:</span> Clock summary at <span class="timestamp-wrapper"><span class="timestamp">[2024-01-24 Wed 19:39]</span></span></caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Headline</th>
<th scope="col" class="org-left">Time</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Total time</b></td>
<td class="org-left"><b>9:47</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;2024-01-24 Wednesday</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">9:47</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;Revisit running J1939 plugin after&#x2026;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">4:17</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;Known Good Release of J1939plugin</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">5:30</td>
</tr>
</tbody>
</table>
</div>

<ol class="org-ol">
<li><a id="orgee35c31"></a>Revisit running J1939 plugin after adding missing SVG's<br />
<div class="outline-text-5" id="text-1-1-5-1">
</div>
<ol class="org-ol">
<li><a id="org721e789"></a>Recap missing SVG's<br />
<div class="outline-text-6" id="text-1-1-5-1-1">
<ul class="org-ul">
<li>Problem: Qt Creator Application Output:
<ul class="org-ul">
<li>qt.svg: Cannot open file 'C:/stw/qtProjects/J1939Plugin/openSYDE-master/opensyde_tool/result/utilities/J1939_openSYDE/images/IconNodeInactive.svg', because: The system cannot find the file specified.</li>
<li>same error for maybe 4-6 other images.  i.e. IconNode.svg, IconImportFile.svg, IconMessage.svg etc.</li>
</ul></li>
<li>Solution: did file search and copy from the other .zip version of the Qt J1939 project (the one that compiled to v. 1.6.x).</li>
</ul>
</div>
</li>
<li><a id="org7fe4c94"></a>Experiment with running J1939 plugin<br />
<ol class="org-ol">
<li><a id="org16927da"></a>General Testing Steps <code>[0/5]</code>:<br />
<div class="outline-text-7" id="text-1-1-5-1-2-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Make new project</li>
<li class="off"><code>[&#xa0;]</code> Add a node (i.e. ESX-4CS-GW)</li>
<li class="off"><code>[&#xa0;]</code> Add a CAN bus and connect to node</li>
<li class="off"><code>[&#xa0;]</code> Save project</li>
<li class="off"><code>[&#xa0;]</code> Open Node in System Definition and Import TSP (confirm datablocks added)
<ul class="org-ul">
<li>BREAK:  When exploring J1939 UI in Bus Edit and going back to Node edit got error "Extremely Nasty Error&#x2026;"  Qt closed the application.</li>
<li>APPLICATION OUTPUT: Warning: File for bus not found:  "C:/stw/qtProjects/J1939Plugin/openSYDE-master/opensyde_tool/Demo4/system_definition/Buses/NewCANBus.xml"</li>
<li>APPLICATION OUTPUT: 06:23:07: C:\stw\qtProjects\J1939Plugin\openSYDE-master\opensyde_tool\result\tool\openSYDE.exe crashed</li>
</ul></li>
</ul>
</div>
</li>
</ol>
</li>
<li><a id="org1df7487"></a>Teams Meeting Today<br />
<div class="outline-text-6" id="text-1-1-5-1-3">
<ul class="org-ul">
<li>Export copy of this journal to html on github <a href="https://github.com/0xbadc0fee/Projects-Journal/blob/master/j1939plugin.html">link</a></li>
<li>Teams test call, (re-check audio and mic every time.)</li>
<li>Go over list of any questions re: Qt Creator, J1939 Plugin, etc
<ul class="org-ul">
<li></li>
</ul></li>
</ul>
</div>
</li>
</ol>
</li>
<li><a id="org5056dcd"></a>Known Good Release of J1939plugin<br />
<div class="outline-text-5" id="text-1-1-5-2">
</div>
<ol class="org-ol">
<li><a id="org183a338"></a><span class="todo TODO">TODO</span> From scratch setup <code>[0/7]</code><br />
<div class="outline-text-6" id="text-1-1-5-2-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Clone git repo</li>
<li class="off"><code>[&#xa0;]</code> blank task</li>
<li class="off"><code>[&#xa0;]</code> download Extras / non-git assets</li>
<li class="off"><code>[&#xa0;]</code> Test compile openSYDE.pro using Qt 5.15.2
<ul class="org-ul">
<li>process will create a couple directories we'll need</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> copy Extras / non-git assets to sub directories</li>
<li class="off"><code>[&#xa0;]</code> Test compile j1939plugin.pro in Qt 5.15.2</li>
<li class="off"><code>[&#xa0;]</code> Confirm new .a file generated and stored in correct build directory</li>
</ul>
</div>
</li>
<li><a id="org3ef3bed"></a>BACKFILL NOTES TOMORROW MORNING!<br />
<div class="outline-text-6" id="text-1-1-5-2-2">
<ul class="org-ul">
<li>ADD TREE STRUCTURE SNAPSHOTS</li>
<li>ADD NOTES ABOUT SCRAPPING AND REBUILDING
<ul class="org-ul">
<li>PROBLEM: j1939 portion was not creating .dll file when building.</li>
<li>PROBLEM: when running in openSYDE, j1939 plugin tasks triggered "widget not found" in application output
<ul class="org-ul">
<li>SOLUTION: changed build from DEBUG to RELEASE</li>
</ul></li>
</ul></li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-orgb45eb28" class="outline-4">
<h4 id="orgb45eb28"><span class="section-number-4">1.1.6.</span> 2024-01-25 Thursday</h4>
<div class="outline-text-4" id="text-1-1-6">
</div>
<ol class="org-ol">
<li><a id="orgf653ce4"></a>Test / Explore state of latest GIT published plugin project<br />
<div class="outline-text-5" id="text-1-1-6-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 4:</span> Clock summary at <span class="timestamp-wrapper"><span class="timestamp">[2024-01-25 Thu 15:48]</span></span></caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Headline</th>
<th scope="col" class="org-left">Time</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Total time</b></td>
<td class="org-left"><b>6:28</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;Test / Explore state of latest GIT&#x2026;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">6:28</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;Create &amp; run new minimal openSYDE&#x2026;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">2:20</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;Teams Meeting "J1939 Review Jira Items"</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">1:51</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;OPSYD-76 library xml file missing</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">2:17</td>
</tr>
</tbody>
</table>
</div>

<ol class="org-ol">
<li><a id="org39a8395"></a>Create &amp; run new minimal openSYDE project for J1939 messaging<br />
<div class="outline-text-6" id="text-1-1-6-1-1">
<ul class="org-ul">
<li>Application and Widget running, OK</li>
<li>New project from scractch, OK</li>
<li>PROBLEM: AppOutput Error when interacting with J1939 message U/I
<ul class="org-ul">
<li>ERROR: Error opening j1939_library.xml file.Error opening j1939_library.xml file.Error opening j1939_library.xml file.</li>
<li>NOTE: no j1939_library.xml file in project as built.  There IS a j1939_library.xml file in the earlier non-GIT build.</li>
<li>SOLUTION: TG is adding default copy to the project repo on GIT.  Will not need to be an EXTRAs asset.</li>
</ul></li>
</ul>
</div>
</li>
