j1939plugin.org
***** OPSYD-76 library xml file missing
:LOGBOOK:
CLOCK: [2024-01-25 Thu 13:30]--[2024-01-25 Thu 15:47] =>  2:17
:END:
+ See J1939PGNLibrary.cpp:182 Add file creation if file check fails
+ Possible to use saveMessageXML() via J1939Messages.cpp?
+ On creation of default file use this structure:
  #+begin_src nxml
    <?xml version='1.0'?>
    <ArrayOfJ1939_PGN xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
     <J1939_PGN>
  
     </J1939_PGN>
    </ArrayOfJ1939_PGN>
  #+end_src
+ CODE STEP THROUGH, J1939PGNLibrary.cpp:
  + 179: makes new string variable named 'fileName' by concatenating the path and the file name
  + 181: creates new memory allocation based on the 'sizeOf' QFile(fileName)
  + 182: *GUARD CLAUSE* if statement. (also see "multiple readers single writer" lock) 
    + if condition tests for FAIL to open
    + if test FAILS, 'return false' (do nothing, no error to report)
    + if test PASSES (did in fact NOT open), then report the error below
    + qDebug() << "Read fail: " << xmlFile->fileName();
  + 189: save new bus file *BUT FILE MUST EXIST AT THIS POINT OR NOTHING TO SAVE*  [2024-01-25 Thu 16:34]  
***** Review my OPSYD Tasks
****** OPSYD-70 TX Method options added
****** OPSYD-71 SPN Scaling and offset options added
****** OPSYD-72 Configurable CANID
*** 2024-01-26 Friday
**** Working on OPSYD-76 Library xml file missing
***** Continued from prev day, see above.
:LOGBOOK:
CLOCK: [2024-01-26 Fri 06:30]--[2024-01-26 Fri 09:51] =>  3:21
:END:
+ Qt recommended QFile usage:
  #+begin_src C++
         QFile file("in.txt");
     if (!file.open(QIODevice::ReadOnly | QIODevice::Text))
         return;

     while (!file.atEnd()) {
         QByteArray line = file.readLine();
         process_line(line);
     }

  #+end_src
+ NOTE:  tested addition of following code for file exists test 
+ RESULTS: No change.  Should have shown a message in QDebug, but no new message ???
+ NEXT ACTION: Verify behavior in application is coming from same area as code.  Insert a break point at the function and debug.
  + make sure Qt Creator has necessary debug symbols, etc.  See online installer tool
+ BACKFILL NOTES HERE:
  + RE: wrong .cpp source of error, moved to J1939Messages.cpp
  + Retested with debug messages to make sure in right spot
  + after confirmed right spot, compared known good code see J1939Messages::findXMLBus function.
  + test ability to make new xml file on fail of exist test
  + test ability to open and close new xml file
  + test write out to new xml file.
*** 2024-01-29 Monday
#+BEGIN: clocktable :scope subtree :maxlevel 5
#+CAPTION: Clock summary at [2024-01-31 Wed 06:21]
| Headline                | Time    |   |       |       |
|-------------------------+---------+---+-------+-------|
| *Total time*            | *11:01* |   |       |       |
|-------------------------+---------+---+-------+-------|
| \_    2024-01-29 Monday |         |   | 11:01 |       |
| \_      [[file:~/org/roam/20231031064611-programming.org::*C++ NOTES][C++ NOTES]]       |         |   |       | 11:01 |
#+END:

****   [[file:~/org/roam/20231031064611-programming.org::*C++ NOTES][C++ NOTES]]
+ see org roam notes and paste in here.
:LOGBOOK:
CLOCK: [2024-01-29 Mon 06:43]--[2024-01-29 Mon 17:44] => 11:01
:END:
*** 2024-01-30 Tuesday
#+BEGIN: clocktable :scope subtree :maxlevel 5
#+CAPTION: Clock summary at [2024-01-31 Wed 06:21]
| Headline                                         | Time   |   |      |      |
|--------------------------------------------------+--------+---+------+------|
| *Total time*                                     | *5:00* |   |      |      |
|--------------------------------------------------+--------+---+------+------|
| \_    2024-01-30 Tuesday                         |        |   | 5:00 |      |
| \_      Finished testing...                      |        |   |      | 2:00 |
| \_      Teams Call, SC & TG; J1939 Plugin...     |        |   |      | 1:30 |
| \_      Finished bug fix OPSYD-76 missing xml... |        |   |      | 1:30 |
#+END:

**** Finished testing J1939Message::saveMessageXML()
:LOGBOOK:
CLOCK: [2024-01-30 Tue 06:18]--[2024-01-30 Tue 08:18] =>  2:00
:END:
**** Teams Call, SC & TG; J1939 Plugin Code Review
:LOGBOOK:
CLOCK: [2024-01-30 Tue 08:30]--[2024-01-30 Tue 10:00] =>  1:30
:END:
