j1939plugin.html
<li><a id="org7a26938"></a>Teams Meeting "J1939 Review Jira Items"<br />
<div class="outline-text-6" id="text-1-1-6-1-2">
</div>
</li>
<li><a id="orgcacf847"></a>OPSYD-76 library xml file missing<br />
<div class="outline-text-6" id="text-1-1-6-1-3">
<ul class="org-ul">
<li>See J1939PGNLibrary.cpp:182 Add file creation if file check fails</li>
<li>Possible to use saveMessageXML() via J1939Messages.cpp?</li>
<li><p>
On creation of default file use this structure:
</p>
<div class="org-src-container">
<pre class="src src-nxml">&lt;?<span style="color: #4f97d7; font-weight: bold;">xml</span> <span style="color: #9f8766;">version='1.0'</span>?&gt;
&lt;<span style="color: #bc6ec5; font-weight: bold;">ArrayOfJ1939_PGN</span> <span style="color: #4f97d7;">xmlns</span>:<span style="color: #7590db;">xsd</span>=<span style="color: #2d9574;">"http://www.w3.org/2001/XMLSchema"</span> <span style="color: #4f97d7;">xmlns</span>:<span style="color: #7590db;">xsi</span>=<span style="color: #2d9574;">"http://www.w3.org/2001/XMLSchema-instance"</span>&gt;
 &lt;<span style="color: #bc6ec5; font-weight: bold;">J1939_PGN</span>&gt;

 &lt;/<span style="color: #bc6ec5; font-weight: bold;">J1939_PGN</span>&gt;
&lt;/<span style="color: #bc6ec5; font-weight: bold;">ArrayOfJ1939_PGN</span>&gt;
</pre>
</div></li>
<li>CODE STEP THROUGH, J1939PGNLibrary.cpp:
<ul class="org-ul">
<li>179: makes new string variable named 'fileName' by concatenating the path and the file name</li>
<li>181: creates new memory allocation based on the 'sizeOf' QFile(fileName)</li>
<li>182: <b>GUARD CLAUSE</b> if statement. (also see "multiple readers single writer" lock) 
<ul class="org-ul">
<li>if condition tests for FAIL to open</li>
<li>if test FAILS, 'return false' (do nothing, no error to report)</li>
<li>if test PASSES (did in fact NOT open), then report the error below</li>
<li>qDebug() &lt;&lt; "Read fail: " &lt;&lt; xmlFile-&gt;fileName();</li>
</ul></li>
<li>189: save new bus file <b>BUT FILE MUST EXIST AT THIS POINT OR NOTHING TO SAVE</b>  <span class="timestamp-wrapper"><span class="timestamp">[2024-01-25 Thu 16:34]  </span></span></li>
</ul></li>
</ul>
</div>
</li>
<li><a id="org7047836"></a>Review my OPSYD Tasks<br />
<ol class="org-ol">
<li><a id="org1e92790"></a>OPSYD-70 TX Method options added<br /></li>
<li><a id="org6311b89"></a>OPSYD-71 SPN Scaling and offset options added<br /></li>
<li><a id="orga10aeda"></a>OPSYD-72 Configurable CANID<br /></li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org0a52f1a" class="outline-4">
<h4 id="org0a52f1a"><span class="section-number-4">1.1.7.</span> 2024-01-26 Friday</h4>
<div class="outline-text-4" id="text-1-1-7">
</div>
<ol class="org-ol">
<li><a id="orgf217a5a"></a>Working on OPSYD-76 Library xml file missing<br />
<ol class="org-ol">
<li><a id="orgdf891b2"></a>Continued from prev day, see above.<br />
<div class="outline-text-6" id="text-1-1-7-1-1">
<ul class="org-ul">
<li><p>
Qt recommended QFile usage:
</p>
<div class="org-src-container">
<pre class="src src-C++">    <span style="color: #ce537a; font-weight: bold;">QFile</span> <span style="color: #7590db;">file</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"in.txt"</span><span style="color: #4f97d7;">)</span>;
<span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">(</span><span style="color: #a45bad;">!</span>file.open<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">QIODevice</span>::ReadOnly | <span style="color: #a45bad;">QIODevice</span>::Text<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
    <span style="color: #4f97d7; font-weight: bold;">return</span>;

<span style="color: #4f97d7; font-weight: bold;">while</span> <span style="color: #4f97d7;">(</span><span style="color: #a45bad;">!</span>file.atEnd<span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7;">{</span>
    <span style="color: #ce537a; font-weight: bold;">QByteArray</span> <span style="color: #7590db;">line</span> = file.readLine<span style="color: #bc6ec5;">()</span>;
    process_line<span style="color: #bc6ec5;">(</span>line<span style="color: #bc6ec5;">)</span>;
<span style="color: #4f97d7;">}</span>

</pre>
</div></li>
<li>NOTE:  tested addition of following code for file exists test</li>
<li>RESULTS: No change.  Should have shown a message in QDebug, but no new message ???</li>
<li>NEXT ACTION: Verify behavior in application is coming from same area as code.  Insert a break point at the function and debug.
<ul class="org-ul">
<li>make sure Qt Creator has necessary debug symbols, etc.  See online installer tool</li>
</ul></li>
<li>BACKFILL NOTES HERE:
<ul class="org-ul">
<li>RE: wrong .cpp source of error, moved to J1939Messages.cpp</li>
<li>Retested with debug messages to make sure in right spot</li>
<li>after confirmed right spot, compared known good code see J1939Messages::findXMLBus function.</li>
<li>test ability to make new xml file on fail of exist test</li>
<li>test ability to open and close new xml file</li>
<li>test write out to new xml file.</li>
</ul></li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org7b61e5c" class="outline-4">
<h4 id="org7b61e5c"><span class="section-number-4">1.1.8.</span> 2024-01-29 Monday</h4>
<div class="outline-text-4" id="text-1-1-8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 5:</span> Clock summary at <span class="timestamp-wrapper"><span class="timestamp">[2024-01-31 Wed 06:21]</span></span></caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Headline</th>
<th scope="col" class="org-left">Time</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Total time</b></td>
<td class="org-left"><b>11:01</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;2024-01-29 Monday</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">11:01</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;<a href="file:///home/scurfman/org/roam/20231031064611-programming.html#MissingReference">C++ NOTES</a></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">11:01</td>
</tr>
</tbody>
</table>
</div>

<ol class="org-ol">
<li><a id="orgb0f1bf5"></a><a href="file:///home/scurfman/org/roam/20231031064611-programming.html#MissingReference">C++ NOTES</a><br />
<div class="outline-text-5" id="text-1-1-8-1">
<ul class="org-ul">
<li>see org roam notes and paste in here.</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgbc8717c" class="outline-4">
<h4 id="orgbc8717c"><span class="section-number-4">1.1.9.</span> 2024-01-30 Tuesday</h4>
<div class="outline-text-4" id="text-1-1-9">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 6:</span> Clock summary at <span class="timestamp-wrapper"><span class="timestamp">[2024-01-31 Wed 06:21]</span></span></caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Headline</th>
<th scope="col" class="org-left">Time</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Total time</b></td>
<td class="org-left"><b>5:00</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;2024-01-30 Tuesday</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">5:00</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;Finished testing&#x2026;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">2:00</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;Teams Call, SC &amp; TG; J1939 Plugin&#x2026;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">1:30</td>
</tr>

<tr>
<td class="org-left">&ensp;&ensp;&ensp;&ensp;&ensp;&ensp;Finished bug fix OPSYD-76 missing xml&#x2026;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">1:30</td>
</tr>
</tbody>
</table>
</div>

<ol class="org-ol">
