j1939plugin.org
**** Finished bug fix OPSYD-76 missing xml file
:LOGBOOK:
CLOCK: [2024-01-30 Tue 10:30]--[2024-01-30 Tue 12:00] =>  1:30
:END:
+ used TG's file save class J1939Message::saveMessageXML
+ code was changed in J1939PGNLibrary.cpp
+ Ideally would have included xml header url, but had trouble parsing the string text of url in C++ / Qt Creator.
  + per section 2.8 of the XML 1.0 Standard, adding declaration (header) is _optional_, so leaving out.
  + NOTE: per section 2.8 of XML 1.1 Standard, declaration is mandatory, so if possilb should be ready?
    #+begin_src C++
    QString fileName = pluginDirectorySave + "j1939_library.xml" ;
    //SGC CODE HERE: Check that lib exists if not, make one
    QFile *xmlFile = new QFile(fileName);
    if (!xmlFile->exists()){
        vector <J1939Message> emptyMessage = {};
        J1939Message * emptyXml = new J1939Message();
        if(emptyMessage.empty())
        {
            std::vector<std::string> lines = { "<?xml version=\"1.0\"?>",
                                              "<ArrayOfJ1939_PGN>",
                                              };
            lines.push_back("</ArrayOfJ1939_PGN>");
            emptyXml->SaveToFile( lines, fileName.toStdString());
        }
        emptyXml->saveMessageXML(emptyMessage,fileName, pluginDirectorySave);
        return false;
    }
    #+end_src
  + pushed to github and closed bug story in Jira   [2024-01-30 Tue 12:00]
*** 2024-01-31 Wednesday
**** Begin OPSYD-37 Add PGN Update Fields
:LOGBOOK:
CLOCK: [2024-01-31 Wed 06:05]
:END:
***** TODO PGN Updates [0/3]
- [ ] TX Methods:
  - [ ] Cyclic
  - [ ] On Change
  - [ ] On Event
  - [ ] Update Generated C files
- [ ] SPN scaling and offset, Update Generated C files.
- [ ] Configurable CANID
***** Change Notes:
+ Look for var mappings in three groups *xmlFile <-> Database <-> UI*
  + use Qt advanced find regex for variable pairs, i.e. regex = .*?pgnUpdate\b.*?\bPGNNumber
+ target sections of code, used search "NewMessage"
  + see J1939PGNLibrary.cpp for *->setPlaceholderText("NewMessage")*
  + see J1939plugin.cpp for *pgnUpdate = new J1939EditMessage(emTable,...,emFormGroupBoxAdd);*
  + see *QGroupBox *J1939PGNLibrary::PGNFormGroup(pgnEdit * pgnUpdate)*
+ PGN Update UI form variables
  + pgnUpdate->PGNName 
  + pgnUpdate->PGNNumber
  + pgnUpdate->dlcSB
  + pgnUpdate-<txRate
  + Group Box = QgroupBox *J1939PGNLibrary::PGNFormGroup(...)
+ PGN Update DB form variables
  + PGNname
  + PGNnum
  + PGNDLC
  + PGNTXRate
  + CLASS = pgnLib
    + setters, i.e. = void setPGNname(...) {...};
    + getters, i.e. = string getSPGNname(...) {...};
+ SPN Update UI form variables (look for addSPNSet)
  + addSPNSet->emSPNName
  + addSPNSet->emSPNNumber
  + addSPNSet->emSPNDataFormatCB
  + addSPNSet->emSPNHighVV
  + addSPNSet->emSPNStartBytes
  + Group Box = QGroupBox* J1939PGNLibrary::SPNFormGroup(...)
+ SPN Update DB form variables
  + SPNName
  + SPNNumber
  + SPNDataFormatCB
  + SPNHighVV
  + mSPNStartByte
  + CLASS = spnLib
    + setters, i.e. = void setSPNName(...) {...};
    + getters, i.e. = string getSPNName(..) {...};
+ XML Load PGN variables
  + vector <pgnLib> pgnList;
  + string PGNName = "",PGNNumber = "", DLC "", 
+ XML Load SPN variables
  + vector <spnLib> spnList = {}; //reading XML file initally creates empty vector for storing SPN's into on read
  + string SPNName = "",SPNNumber = "", DataFormat = "", HighestVV = "", StartingByte = "";
+ XML Read / Write
  + basic read in flow is [ XML -> QXmlStreamReader -> QString variable -> Std String variable -> PGNName (UI) ]
    + ?? on save, PGNName (UI) mapped to PGNname (DB) 
:variableMappingTable:
| Descriptive Name        | UI                | DB              | XML          | DP |
|-------------------------+-------------------+-----------------+--------------+----|
| PGN Name                | PGNName           | PGNname         | Name         |    |
| PGN Number              | PGNNumber         | PGNnum          | Number       |    |
| PGN DLC                 | dlcSB             | PGNDLC          | DLC          |    |
| PGN Tx Rate             | txRate            | PGNTXRate       | TXRate       |    |
| *PGN Tx Method*         |                   |                 |              |    |
| SPN Name                | emSPNName         | SPNName         | SPNName      |    |
| SPN Number              | emSPNNumber       | SPNNumber       | SPNNumber    |    |
| SPN Data Format         | emSPNDataFormatCB | SPNDataFormatCB | Data Format  |    |
| SPN Highest Valid Value | emSPNHighVV       | SPNHighVV       | HighestVV    |    |
| SPN Start Position Bit  | emSPNStartBytes   | mSPNStartByte   | StartingByte |    |
| *SPN Offset Value*      |                   |                 |              |    |
| *SPN Scale Value*       |                   |                 |              |    |
:END:
