j1939plugin.html
<li><a id="orge51a866"></a>Finished testing J1939Message::saveMessageXML()<br />
<div class="outline-text-5" id="text-1-1-9-1">
</div>
</li>
<li><a id="org8aa24e4"></a>Teams Call, SC &amp; TG; J1939 Plugin Code Review<br />
<div class="outline-text-5" id="text-1-1-9-2">
</div>
</li>
<li><a id="org0020dae"></a>Finished bug fix OPSYD-76 missing xml file<br />
<div class="outline-text-5" id="text-1-1-9-3">
<ul class="org-ul">
<li>used TG's file save class J1939Message::saveMessageXML</li>
<li>code was changed in J1939PGNLibrary.cpp</li>
<li>Ideally would have included xml header url, but had trouble parsing the string text of url in C++ / Qt Creator.
<ul class="org-ul">
<li>per section 2.8 of the XML 1.0 Standard, adding declaration (header) is <span class="underline">optional</span>, so leaving out.</li>
<li><p>
NOTE: per section 2.8 of XML 1.1 Standard, declaration is mandatory, so if possilb should be ready?
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #ce537a; font-weight: bold;">QString</span> <span style="color: #7590db;">fileName</span> = pluginDirectorySave + <span style="color: #2d9574;">"j1939_library.xml"</span> ;
<span style="color: #2aa1ae; background-color: #292e34;">//</span><span style="color: #2aa1ae; background-color: #292e34;">SGC CODE HERE: Check that lib exists if not, make one</span>
<span style="color: #ce537a; font-weight: bold;">QFile</span> *<span style="color: #7590db;">xmlFile</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">QFile</span><span style="color: #4f97d7;">(</span>fileName<span style="color: #4f97d7;">)</span>;
<span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">(</span><span style="color: #a45bad;">!</span>xmlFile-&gt;exists<span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">){</span>
    <span style="color: #ce537a; font-weight: bold;">vector</span> <span style="color: #bc6ec5;">&lt;</span>J1939Message<span style="color: #bc6ec5;">&gt;</span> <span style="color: #7590db;">emptyMessage</span> = <span style="color: #bc6ec5;">{}</span>;
    <span style="color: #ce537a; font-weight: bold;">J1939Message</span> * <span style="color: #7590db;">emptyXml</span> = <span style="color: #4f97d7; font-weight: bold;">new</span> <span style="color: #ce537a; font-weight: bold;">J1939Message</span><span style="color: #bc6ec5;">()</span>;
    <span style="color: #4f97d7; font-weight: bold;">if</span><span style="color: #bc6ec5;">(</span>emptyMessage.empty<span style="color: #2d9574;">()</span><span style="color: #bc6ec5;">)</span>
    <span style="color: #bc6ec5;">{</span>
        <span style="color: #a45bad;">std</span>::<span style="color: #ce537a; font-weight: bold;">vector</span><span style="color: #2d9574;">&lt;</span><span style="color: #a45bad;">std</span>::string<span style="color: #2d9574;">&gt;</span> <span style="color: #7590db;">lines</span> = <span style="color: #2d9574;">{</span> <span style="color: #2d9574;">"&lt;?xml version=\"1.0\"?&gt;"</span>,
                                          <span style="color: #2d9574;">"&lt;ArrayOfJ1939_PGN&gt;"</span>,
                                          <span style="color: #2d9574;">}</span>;
        lines.push_back<span style="color: #2d9574;">(</span><span style="color: #2d9574;">"&lt;/ArrayOfJ1939_PGN&gt;"</span><span style="color: #2d9574;">)</span>;
        emptyXml-&gt;SaveToFile<span style="color: #2d9574;">(</span> lines, fileName.toStdString<span style="color: #67b11d;">()</span><span style="color: #2d9574;">)</span>;
    <span style="color: #bc6ec5;">}</span>
    emptyXml-&gt;saveMessageXML<span style="color: #bc6ec5;">(</span>emptyMessage,fileName, pluginDirectorySave<span style="color: #bc6ec5;">)</span>;
    <span style="color: #4f97d7; font-weight: bold;">return</span> <span style="color: #a45bad;">false</span>;
<span style="color: #4f97d7;">}</span>
</pre>
</div></li>
<li>pushed to github and closed bug story in Jira   <span class="timestamp-wrapper"><span class="timestamp">[2024-01-30 Tue 12:00]</span></span></li>
</ul></li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org235cb10" class="outline-4">
<h4 id="org235cb10"><span class="section-number-4">1.1.10.</span> 2024-01-31 Wednesday</h4>
<div class="outline-text-4" id="text-1-1-10">
</div>
<ol class="org-ol">
<li><a id="orga69c740"></a>Begin OPSYD-37 Add PGN Update Fields<br />
<div class="outline-text-5" id="text-1-1-10-1">
</div>
<ol class="org-ol">
<li><a id="org0f15583"></a><span class="todo TODO">TODO</span> PGN Updates <code>[0/3]</code><br />
<div class="outline-text-6" id="text-1-1-10-1-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> TX Methods:
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Cyclic</li>
<li class="off"><code>[&#xa0;]</code> On Change</li>
<li class="off"><code>[&#xa0;]</code> On Event</li>
<li class="off"><code>[&#xa0;]</code> Update Generated C files</li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> SPN scaling and offset, Update Generated C files.</li>
<li class="off"><code>[&#xa0;]</code> Configurable CANID</li>
</ul>
</div>
</li>
<li><a id="org7289777"></a>Change Notes:<br />
<div class="outline-text-6" id="text-1-1-10-1-2">
<ul class="org-ul">
<li>Look for var mappings in three groups <b>xmlFile &lt;-&gt; Database &lt;-&gt; UI</b>
<ul class="org-ul">
<li>use Qt advanced find regex for variable pairs, i.e. regex = .*?pgnUpdate\b.*?\bPGNNumber</li>
</ul></li>
<li>target sections of code, used search "NewMessage"
<ul class="org-ul">
<li>see J1939PGNLibrary.cpp for <b>-&gt;setPlaceholderText("NewMessage")</b></li>
<li>see J1939plugin.cpp for <b>pgnUpdate = new J1939EditMessage(emTable,&#x2026;,emFormGroupBoxAdd);</b></li>
<li>see <b>QGroupBox *J1939PGNLibrary::PGNFormGroup(pgnEdit * pgnUpdate)</b></li>
</ul></li>
<li>PGN Update UI form variables
<ul class="org-ul">
<li>pgnUpdate-&gt;PGNName</li>
<li>pgnUpdate-&gt;PGNNumber</li>
<li>pgnUpdate-&gt;dlcSB</li>
<li>pgnUpdate-&lt;txRate</li>
<li>Group Box = QgroupBox *J1939PGNLibrary::PGNFormGroup(&#x2026;)</li>
</ul></li>
<li>PGN Update DB form variables
<ul class="org-ul">
<li>PGNname</li>
<li>PGNnum</li>
<li>PGNDLC</li>
<li>PGNTXRate</li>
<li>CLASS = pgnLib
<ul class="org-ul">
<li>setters, i.e. = void setPGNname(&#x2026;) {&#x2026;};</li>
<li>getters, i.e. = string getSPGNname(&#x2026;) {&#x2026;};</li>
</ul></li>
</ul></li>
<li>SPN Update UI form variables (look for addSPNSet)
<ul class="org-ul">
<li>addSPNSet-&gt;emSPNName</li>
<li>addSPNSet-&gt;emSPNNumber</li>
<li>addSPNSet-&gt;emSPNDataFormatCB</li>
<li>addSPNSet-&gt;emSPNHighVV</li>
<li>addSPNSet-&gt;emSPNStartBytes</li>
<li>Group Box = QGroupBox* J1939PGNLibrary::SPNFormGroup(&#x2026;)</li>
</ul></li>
<li>SPN Update DB form variables
<ul class="org-ul">
<li>SPNName</li>
<li>SPNNumber</li>
<li>SPNDataFormatCB</li>
<li>SPNHighVV</li>
<li>mSPNStartByte</li>
<li>CLASS = spnLib
<ul class="org-ul">
<li>setters, i.e. = void setSPNName(&#x2026;) {&#x2026;};</li>
<li>getters, i.e. = string getSPNName(..) {&#x2026;};</li>
</ul></li>
</ul></li>
<li>XML Load PGN variables
<ul class="org-ul">
<li>vector &lt;pgnLib&gt; pgnList;</li>
<li>string PGNName = "",PGNNumber = "", DLC "",</li>
</ul></li>
<li>XML Load SPN variables
<ul class="org-ul">
<li>vector &lt;spnLib&gt; spnList = {}; //reading XML file initally creates empty vector for storing SPN's into on read</li>
<li>string SPNName = "",SPNNumber = "", DataFormat = "", HighestVV = "", StartingByte = "";</li>
</ul></li>
<li>XML Read / Write
<ul class="org-ul">
<li>basic read in flow is [ XML -&gt; QXmlStreamReader -&gt; QString variable -&gt; Std String variable -&gt; PGNName (UI) ]
<ul class="org-ul">
<li>?? on save, PGNName (UI) mapped to PGNname (DB)</li>
</ul></li>
</ul></li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: scurfman</p>
<p class="date">Created: 2024-01-31 Wed 07:57</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>